; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.__mbstate_t.559, i8* }
%struct.__mbstate_t.559 = type { i32, i32 }
%struct.MemorySegment = type { i8*, i64, i32, i8, i8, i8 }
%struct.exe_file_t = type { i32, i32, i64, %struct.exe_disk_file_t* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !5, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "02c0db7d43910a8924b2180232bacf45")
!4 = !{!5, !6, !8, !10, !22, !24}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !12, line: 1036, baseType: !13)
!12 = !DIFile(filename: "./include/elf.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "280b87e0a4080980f4c613bf16ed323f")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 1026, size: 128, elements: !14)
!14 = !{!15, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !13, file: !12, line: 1028, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 58, baseType: !9)
!17 = !DIFile(filename: "./include/stdint.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "996bf1fb6caa3282c1964171127ad56a")
!18 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !13, file: !12, line: 1035, baseType: !19, size: 64, offset: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !13, file: !12, line: 1029, size: 64, elements: !20)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !19, file: !12, line: 1031, baseType: !16, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 46, baseType: !9)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!24 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!0, !26, !30, !32, !34, !37, !39, !46, !49}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !28, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !28, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !22, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !41, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!41 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !42, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!42 = !DISubroutineType(types: !43)
!43 = !{null}
!44 = !{}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !55, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!54 = !DIFile(filename: "klee/runtime/POSIX/fd.c", directory: "/home/shafi/Research/KLEE", checksumkind: CSK_MD5, checksum: "fd27ffca8f23688b1cbb26cb3f8119d2")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/shafi/Research/KLEE/klee/runtime/POSIX/fd.c", directory: "/home/shafi/Research/KLEE/klee_build/runtime/POSIX", checksumkind: CSK_MD5, checksum: "fd27ffca8f23688b1cbb26cb3f8119d2")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee/runtime/POSIX/fd.h", directory: "/home/shafi/Research/KLEE", checksumkind: CSK_MD5, checksum: "9dc4d4f19a43ba557c3ab447f2f3c234")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !5, !82, !9, !86, !6, !101, !45, !7}
!81 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !9)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !9)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !9)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !9)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !143, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !5, !22}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !150, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !22}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !28, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !44)
!173 = !DISubroutineType(types: !174)
!174 = !{!6, !6, !22}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "6b2866feb4effdd243a6d2ad04178572")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "599f80544f873a2ed327ea753999aa6d")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "d2acef852115df228b64a6f51a6bad04")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !6, !203, !205, !208, !96, !209, !210, !223, !231, !9}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "c9c3a760038910c15bf8cd5df79e8d7e")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "5d3626eea7d6a2aaaba36e9a6eede6c5")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "ff69fe50708aa486cd32d2c69e12cc37")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !17, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !23, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !28, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !28, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !28, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !28, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !28, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !28, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !28, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !28, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !28, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !28, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !28, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !28, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !28, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !28, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !28, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !28, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !28, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !28, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !28, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !28, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !28, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !28, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !28, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !28, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !28, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !28, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !28, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !28, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !28, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !28, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !28, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !28, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !28, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !28, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !28, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !28, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !28, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !28, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !28, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !28, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !28, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !28, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !28, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !28, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !28, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !28, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !28, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !28, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !28, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !28, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !28, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !28, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !28, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !28, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !28, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !28, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !28, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !28, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !28, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !28, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !28, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !28, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !28, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !28, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !28, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !28, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !28, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !28, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !28, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !28, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !28, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !28, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !28, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !28, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !28, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !28, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !28, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !28, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !28, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !28, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !28, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !28, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !28, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !28, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !28, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !28, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !28, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !28, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !28, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !28, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "4be07f3b0ecb392ed80de3da184d87ae")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "70cf100e22d87317ae53d38f310fbf54")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "f3087838ed931057d6634bfd1a454d76")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "8ff64f580ee3668870eb49bcbfa374a6")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !5, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !502, file: !503, line: 49, type: !45, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !504, globals: !518, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "1b6a5002c8ccbecac21fd5865047b001")
!504 = !{!505, !5, !514}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !508)
!507 = !DIFile(filename: "./include/signal.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "7a473019838bc8a086e72b07da7e12b6")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "5be4663919ae70a2a63143f4cf3e23c1")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !510, file: !509, line: 30, baseType: !513, size: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !449)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !507, line: 75, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !45}
!518 = !{!500}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !521, file: !524, line: 309, type: !515, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !523, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "d048e19c57c2fb60337762a73956895f")
!523 = !{!519}
!524 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "4ac01cfeb6d56cd88c0c7f25523d13d7")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "memorySegmentCount", scope: !527, file: !596, line: 22, type: !45, isLocal: false, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !585, globals: !586, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "stase_main.c", directory: "/home/shafi/Research/ChainSynthesis/attack-synthesis-suite-c/stase", checksumkind: CSK_MD5, checksum: "2f11f3eb120e2a4b64a4bcf1ac41958f")
!529 = !{!530, !535, !541, !553}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 16, baseType: !62, size: 32, elements: !532)
!531 = !DIFile(filename: "./../common.h", directory: "/home/shafi/Research/ChainSynthesis/attack-synthesis-suite-c/stase", checksumkind: CSK_MD5, checksum: "4b24e50270af987bbae933e70ec8aa95")
!532 = !{!533, !534}
!533 = !DIEnumerator(name: "PRIVILEGED_MODE", value: 0)
!534 = !DIEnumerator(name: "USER_MODE", value: 1)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 27, baseType: !62, size: 32, elements: !536)
!536 = !{!537, !538, !539, !540}
!537 = !DIEnumerator(name: "CODE_SEGMENT", value: 0)
!538 = !DIEnumerator(name: "DATA_SEGMENT", value: 1)
!539 = !DIEnumerator(name: "RESERVED_SEGMENT", value: 2)
!540 = !DIEnumerator(name: "PROTECTED_SEGMENT", value: 3)
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !542, line: 24, baseType: !62, size: 32, elements: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "5ca1da466a04f4b8f6d88ec84b75042e")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552}
!544 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!545 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!546 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!547 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!548 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!549 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!550 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!551 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!552 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !554, line: 40, baseType: !62, size: 32, elements: !555)
!554 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "fbd766480c8cb9a8fe07ee7aa568ee60")
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!556 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!557 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!558 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!559 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!560 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!561 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!562 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!563 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!564 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!565 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!566 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!567 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!568 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!569 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!570 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!571 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!572 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!573 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!574 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!575 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!576 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!577 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!578 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!579 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!580 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!581 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!582 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!583 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!584 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!585 = !{!5, !45, !6}
!586 = !{!525, !587, !590, !594, !597, !599, !601, !603, !620}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "EXECUTE", scope: !527, file: !589, line: 6, type: !45, isLocal: false, isDefinition: true)
!589 = !DIFile(filename: "./../user_accessible.c", directory: "/home/shafi/Research/ChainSynthesis/attack-synthesis-suite-c/stase", checksumkind: CSK_MD5, checksum: "d5eff0a54b2d5271e85ca2a19131ddd5")
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "current_mode", scope: !527, file: !592, line: 21, type: !593, isLocal: false, isDefinition: true)
!592 = !DIFile(filename: "./../testcases/CWE190_Integer_Overflow/s01/../../../common.h", directory: "/home/shafi/Research/ChainSynthesis/attack-synthesis-suite-c/stase", checksumkind: CSK_MD5, checksum: "4b24e50270af987bbae933e70ec8aa95")
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExecutionMode", file: !531, line: 19, baseType: !530)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "user_buffer", scope: !527, file: !596, line: 14, type: !6, isLocal: false, isDefinition: true)
!596 = !DIFile(filename: "./../common.c", directory: "/home/shafi/Research/ChainSynthesis/attack-synthesis-suite-c/stase", checksumkind: CSK_MD5, checksum: "5551b297d902144e965bcb7a3cc12818")
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "command_buffer", scope: !527, file: !596, line: 15, type: !6, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "reserved_buffer", scope: !527, file: !596, line: 16, type: !6, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "protected_buffer", scope: !527, file: !596, line: 17, type: !6, isLocal: false, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "memoryMap", scope: !527, file: !596, line: 21, type: !605, isLocal: false, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 1920, elements: !296)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemorySegment", file: !596, line: 11, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !596, line: 4, size: 192, elements: !608)
!608 = !{!609, !610, !611, !613, !618, !619}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "baseAddress", scope: !607, file: !596, line: 5, baseType: !5, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !607, file: !596, line: 6, baseType: !22, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !607, file: !596, line: 7, baseType: !612, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemoryType", file: !531, line: 32, baseType: !535)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !607, file: !596, line: 8, baseType: !614, size: 8, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !615, line: 24, baseType: !616)
!615 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !617, line: 38, baseType: !96)
!617 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !607, file: !596, line: 9, baseType: !614, size: 8, offset: 168)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !607, file: !596, line: 10, baseType: !614, size: 8, offset: 176)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "symbolic_BUFFER_SIZE", scope: !527, file: !528, line: 6, type: !45, isLocal: false, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__exe_env", scope: !624, file: !629, line: 34, type: !677, isLocal: false, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C89, file: !625, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/shafi/Research/KLEE/klee/runtime/POSIX/fd_init.c", directory: "/home/shafi/Research/KLEE/klee_build/runtime/POSIX", checksumkind: CSK_MD5, checksum: "0b3ec57f306e31d8d312045d84027ae7")
!626 = !{!622, !627}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !624, file: !629, line: 21, type: !630, isLocal: false, isDefinition: true)
!629 = !DIFile(filename: "klee/runtime/POSIX/fd_init.c", directory: "/home/shafi/Research/KLEE", checksumkind: CSK_MD5, checksum: "0b3ec57f306e31d8d312045d84027ae7")
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !61, line: 86, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 74, size: 832, elements: !632)
!632 = !{!633, !634, !665, !666, !667, !668, !669, !671, !672, !673, !674, !675, !676}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !631, file: !61, line: 75, baseType: !62, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !631, file: !61, line: 76, baseType: !635, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !61, line: 56, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 52, size: 192, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !61, line: 53, baseType: !62, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !637, file: !61, line: 54, baseType: !6, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !637, file: !61, line: 55, baseType: !642, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !103, line: 103, size: 1152, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !657, !662, !663, !664}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !643, file: !103, line: 108, baseType: !106, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !643, file: !103, line: 110, baseType: !91, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !643, file: !103, line: 111, baseType: !110, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !643, file: !103, line: 112, baseType: !112, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !643, file: !103, line: 119, baseType: !114, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !643, file: !103, line: 120, baseType: !116, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !643, file: !103, line: 122, baseType: !45, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !643, file: !103, line: 123, baseType: !106, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !643, file: !103, line: 124, baseType: !120, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !643, file: !103, line: 130, baseType: !122, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !643, file: !103, line: 131, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 181, baseType: !81)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !643, file: !103, line: 139, baseType: !658, size: 128, offset: 576)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !658, file: !127, line: 16, baseType: !130, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !658, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !643, file: !103, line: 140, baseType: !658, size: 128, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !643, file: !103, line: 141, baseType: !658, size: 128, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !643, file: !103, line: 151, baseType: !136, size: 192, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !631, file: !61, line: 76, baseType: !635, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !631, file: !61, line: 77, baseType: !62, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !631, file: !61, line: 78, baseType: !635, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !631, file: !61, line: 81, baseType: !62, size: 32, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !631, file: !61, line: 84, baseType: !670, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !631, file: !61, line: 84, baseType: !670, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !631, file: !61, line: 84, baseType: !670, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !631, file: !61, line: 84, baseType: !670, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !631, file: !61, line: 84, baseType: !670, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !631, file: !61, line: 85, baseType: !670, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !631, file: !61, line: 85, baseType: !670, size: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !61, line: 100, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 93, size: 6208, elements: !679)
!679 = !{!680, !691, !692}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !678, file: !61, line: 94, baseType: !681, size: 6144)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 6144, elements: !689)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !61, line: 72, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 65, size: 192, elements: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !683, file: !61, line: 66, baseType: !45, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !61, line: 67, baseType: !62, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !683, file: !61, line: 70, baseType: !82, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !683, file: !61, line: 71, baseType: !635, size: 64, offset: 128)
!689 = !{!690}
!690 = !DISubrange(count: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !678, file: !61, line: 95, baseType: !159, size: 32, offset: 6144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !678, file: !61, line: 99, baseType: !45, size: 32, offset: 6176)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !695, file: !696, line: 11, type: !701, isLocal: true, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "c59ea4351bbf1b576d36965baab589af")
!697 = !{!698, !693}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !695, file: !696, line: 20149, type: !700, isLocal: false, isDefinition: true)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !703, line: 91, baseType: !704)
!703 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "244d1959dadcde13ac6cb3f89cd863e0")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 31, size: 2047232, elements: !705)
!705 = !{!706, !710, !714, !718, !722, !726, !730, !734, !738, !742, !746, !750, !754, !771, !775, !777, !779, !783, !785, !789, !793, !797, !801, !805, !809, !813, !817, !821, !825, !829, !830, !834, !838, !842, !846, !850}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !704, file: !703, line: 37, baseType: !707, size: 3360)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 3360, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 420)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !704, file: !703, line: 38, baseType: !711, size: 4032, offset: 3360)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 4032, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 504)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !704, file: !703, line: 40, baseType: !715, size: 28160, offset: 7392)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 28160, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 1760)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !704, file: !703, line: 41, baseType: !719, size: 36224, offset: 35552)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 36224, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 4528)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !704, file: !703, line: 46, baseType: !723, size: 28832, offset: 71776)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 28832, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 3604)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !704, file: !703, line: 47, baseType: !727, size: 13440, offset: 100608)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 13440, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 1680)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !704, file: !703, line: 48, baseType: !731, size: 3136, offset: 114048)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 3136, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 196)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !704, file: !703, line: 53, baseType: !735, size: 408, offset: 117184)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 408, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 51)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !704, file: !703, line: 54, baseType: !739, size: 224, offset: 117592)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 224, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 28)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !704, file: !703, line: 55, baseType: !743, size: 13168, offset: 117816)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 13168, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1646)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !704, file: !703, line: 56, baseType: !747, size: 226824, offset: 130984)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 226824, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 28353)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !704, file: !703, line: 58, baseType: !751, size: 14432, offset: 357808)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 14432, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 1804)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !704, file: !703, line: 62, baseType: !755, size: 15824, offset: 372240)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 15824, elements: !769)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !758, line: 21, baseType: !759)
!758 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "ca2edf0972e2b2d1234894064661281f")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 16, size: 688, elements: !760)
!760 = !{!761, !763, !764, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !759, file: !758, line: 17, baseType: !762, size: 128)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !449)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !759, file: !758, line: 18, baseType: !762, size: 128, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !759, file: !758, line: 19, baseType: !762, size: 128, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !759, file: !758, line: 20, baseType: !766, size: 304, offset: 384)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 304, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 38)
!769 = !{!770}
!770 = !DISubrange(count: 23)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !704, file: !703, line: 65, baseType: !772, size: 160, offset: 388064)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 20)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !704, file: !703, line: 65, baseType: !776, size: 160, offset: 388224)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 160, elements: !296)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !704, file: !703, line: 65, baseType: !778, size: 320, offset: 388384)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 320, elements: !773)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !704, file: !703, line: 66, baseType: !780, size: 360, offset: 388704)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 360, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 45)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !704, file: !703, line: 66, baseType: !784, size: 48, offset: 389072)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 48, elements: !137)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !704, file: !703, line: 66, baseType: !786, size: 240, offset: 389120)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 240, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 15)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !704, file: !703, line: 67, baseType: !790, size: 31152, offset: 389360)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 31152, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 3894)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !704, file: !703, line: 67, baseType: !794, size: 352, offset: 420512)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 352, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 22)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !704, file: !703, line: 67, baseType: !798, size: 6512, offset: 420864)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 6512, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 407)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !704, file: !703, line: 68, baseType: !802, size: 66000, offset: 427376)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 66000, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 8250)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !704, file: !703, line: 68, baseType: !806, size: 800, offset: 493376)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 800, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 50)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !704, file: !703, line: 68, baseType: !810, size: 54864, offset: 494176)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 54864, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 3429)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !704, file: !703, line: 70, baseType: !814, size: 2976, offset: 549040)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2976, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 372)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !704, file: !703, line: 70, baseType: !818, size: 64, offset: 552016)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 4)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !704, file: !703, line: 70, baseType: !822, size: 3200, offset: 552080)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 3200, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 200)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !704, file: !703, line: 72, baseType: !826, size: 1458256, offset: 555280)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 1458256, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 91141)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !704, file: !703, line: 74, baseType: !291, size: 48, offset: 2013536)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !704, file: !703, line: 75, baseType: !831, size: 1536, offset: 2013632)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 24)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !704, file: !703, line: 80, baseType: !835, size: 22608, offset: 2015168)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 22608, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 2826)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !704, file: !703, line: 81, baseType: !839, size: 6680, offset: 2037776)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 6680, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 835)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !704, file: !703, line: 82, baseType: !843, size: 144, offset: 2044456)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 144, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 18)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !704, file: !703, line: 85, baseType: !847, size: 552, offset: 2044600)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 552, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 69)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !704, file: !703, line: 87, baseType: !851, size: 2040, offset: 2045152)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2040, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 255)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !856, file: !861, line: 471, type: !862, isLocal: false, isDefinition: true)
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !858, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "25d3073f65183bacc5ad80681e083f8f")
!858 = !{!854, !859}
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !856, file: !861, line: 862, type: !262, isLocal: false, isDefinition: true)
!861 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "c05ee986cef45c09a6cd15176ea0819e")
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 6144, elements: !277)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !865, file: !861, line: 878, type: !870, isLocal: false, isDefinition: true)
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !867, splitDebugInlining: false, nameTableKind: None)
!866 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "a40ba6526665cc7ed61022f7779f899e")
!867 = !{!863, !868}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !865, file: !861, line: 981, type: !269, isLocal: false, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 6144, elements: !277)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !873, file: !861, line: 1000, type: !870, isLocal: false, isDefinition: true)
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !875, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "68abebc36db14d33500341d9dfc3ec5d")
!875 = !{!871, !876}
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !873, file: !861, line: 1103, type: !269, isLocal: false, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "h_errno", scope: !880, file: !881, line: 8, type: !45, isLocal: false, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !882, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "af29bdada8d5bb75738d8e57193b5c50")
!882 = !{!883, !878}
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "errno", scope: !880, file: !881, line: 7, type: !45, isLocal: false, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "static_fd", scope: !887, file: !888, line: 39, type: !45, isLocal: true, isDefinition: true)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !889, globals: !926, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "8edbc4c10e0195e4fae0c94b31d52b08")
!889 = !{!5, !890, !893, !6}
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !891, line: 88, baseType: !892)
!891 = !DIFile(filename: "./include/sys/types.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "445c324077d202fc433521c89d13a88a")
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !267, line: 145, baseType: !81)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !895, line: 60, size: 3200, elements: !896)
!895 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "f15e31c8141d9b3dd68511e9620c6b12")
!896 = !{!897, !898, !901, !903, !905, !906, !907, !912, !913, !921, !924}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !894, file: !895, line: 62, baseType: !273, size: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !894, file: !895, line: 63, baseType: !899, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !891, line: 100, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !267, line: 147, baseType: !45)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !894, file: !895, line: 64, baseType: !902, size: 256, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !689)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !894, file: !895, line: 65, baseType: !904, size: 32, offset: 320)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !819)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !894, file: !895, line: 66, baseType: !902, size: 256, offset: 352)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !894, file: !895, line: 67, baseType: !98, size: 2048, offset: 608)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !894, file: !895, line: 68, baseType: !908, size: 32, offset: 2656)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !895, line: 52, size: 32, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !908, file: !895, line: 54, baseType: !273, size: 16)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !908, file: !895, line: 55, baseType: !273, size: 16, offset: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !894, file: !895, line: 81, baseType: !81, size: 64, offset: 2688)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !894, file: !895, line: 82, baseType: !914, size: 128, offset: 2752)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !915, line: 73, size: 128, elements: !916)
!915 = !DIFile(filename: "./include/bits/time.h", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "ebddaf4e092a218d6ea40992cd063fa2")
!916 = !{!917, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !914, file: !915, line: 75, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !267, line: 153, baseType: !81)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !914, file: !915, line: 76, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !267, line: 155, baseType: !81)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !894, file: !895, line: 85, baseType: !922, size: 128, offset: 2880)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, elements: !819)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !17, line: 41, baseType: !45)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !894, file: !895, line: 86, baseType: !925, size: 160, offset: 3008)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !773)
!926 = !{!885, !927, !929, !931}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "static_utmp", scope: !887, file: !888, line: 40, type: !894, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "static_ut_name", scope: !887, file: !888, line: 42, type: !28, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "default_file_name", scope: !887, file: !888, line: 41, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 112, elements: !284)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "_sigintr", scope: !936, file: !937, line: 27, type: !940, isLocal: false, isDefinition: true)
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !938, globals: !939, splitDebugInlining: false, nameTableKind: None)
!937 = !DIFile(filename: "libc/signal/signal.c", directory: "/home/shafi/Research/KLEE/klee-uclibc", checksumkind: CSK_MD5, checksum: "b4518f82f4cf921a61935e79ae87235f")
!938 = !{!514}
!939 = !{!934}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !942, file: !509, line: 30, baseType: !513, size: 1024)
